{"data":{"allMarkdownRemark":{"totalCount":5,"edges":[{"node":{"fields":{"slug":"/Poker Simulation/"},"excerpt":"Under development Video of my project:","timeToRead":1,"frontmatter":{"title":"Poker Simulation","summary":"(UNDER DEVELOPMENT) A game on emotions!","category":"Project"}}},{"node":{"fields":{"slug":"/Performance Bounceback/"},"excerpt":"Introduction Performance optimisation is one of the most important skillsets for a VR developer, since apps running below the target…","timeToRead":7,"frontmatter":{"title":"Performance Bounceback","summary":"Performance Bounceback is initial a extremely unperformant game. Through the use of deep profiler and code optimisation, the game is now optimised to a consistent 90 FPS","category":"Project"}}},{"node":{"fields":{"slug":"/Rube Goldberg/"},"excerpt":"Introduction This is a project that I have done with Udacity that provides me the opportunity to create a Virtual Reality Rube\nGoldberg Game…","timeToRead":8,"frontmatter":{"title":"Rube Goldberg","summary":"Rube Goldberg is a game that Users have to create different contraptions to get the ball into the goal position using gravity and physics","category":"Project"}}},{"node":{"fields":{"slug":"/Puzzler/"},"excerpt":"Introduction This is a project that I have done with Udacity that provides me an opportunity to create a Virtual Reality Simon Says puzzle…","timeToRead":5,"frontmatter":{"title":"The Puzzler","summary":"Similar to a Simon Says game, the player is to follow a sequence of lighting in order escape the dungeon","category":"Project"}}},{"node":{"fields":{"slug":"/The Maze/"},"excerpt":"Abstract: The Maze is developed for Google VR Cardboard. It requires the user to navigate across a maze with the use of Waypoints…","timeToRead":4,"frontmatter":{"title":"The Maze","summary":"The Maze is developed for Google VR Cardboard. It requires the user to navigate across a maze with the use of Waypoints","category":"Project"}}}]},"site":{"siteMetadata":{"facebook":{"appId":""}}}},"pageContext":{"category":"Project"}}